УТ/src/Documents/CRM_УстановкаИспользуемыхПоказателей/CRM_УстановкаИспользуемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_УстановкаИспользуемыхПоказателей</name>
  <comment>Соглашение об используемых показателях планирования</comment>
  <registerRecords>InformationRegister.CRM_ИспользуемыеКлючевыеПоказатели</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПоказателяМаксимум</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.CRM_ШаблоныКлючевыхПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБонуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПериода</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПериодаПланирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользуемыеПоказатели</name>
    <comment>Используемые показатели планирования</comment>
    <attributes>
      <name>Показатель</name>
      <comment>Показатель планирования</comment>
      <type>
        <types>CatalogRef.CRM_ШаблоныКлючевыхПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонуса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателяМаксимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Менеджеры</name>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/Documents/CRM_УстановкаИспользуемыхПоказателей/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("ПериодПланирования") Тогда
			Объект.НачалоПериодаПланирования = Параметры.ПериодПланирования.ДатаНачала;
			Объект.КонецПериодаПланирования = Параметры.ПериодПланирования.ДатаОкончания;
			Если Месяц(Объект.НачалоПериодаПланирования) = Месяц(Объект.КонецПериодаПланирования) Тогда
				Объект.ВидПериода = Перечисления.Периодичность.Месяц;
			ИначеЕсли Месяц(Объект.КонецПериодаПланирования) - Месяц(Объект.НачалоПериодаПланирования) = 2 Тогда
				Объект.ВидПериода = Перечисления.Периодичность.Квартал;
			Иначе
				Объект.ВидПериода = Перечисления.Периодичность.Год;
			КонецЕсли;
		Иначе	
			Объект.НачалоПериодаПланирования = НачалоМесяца(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
			Объект.КонецПериодаПланирования = КонецМесяца(CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса());
			Объект.ВидПериода = Перечисления.Периодичность.Месяц;
		КонецЕсли;
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	Если Параметры.Свойство("Исполнитель") Тогда
		Объект.Исполнитель = Параметры.Исполнитель;
	КонецЕсли;
	Если Параметры.Свойство("Показатель") Тогда
		Объект.Показатель = Параметры.Показатель;
	КонецЕсли;
	Если Объект.Показатель.ЦелевойТренд = "Интервал" Тогда
		Элементы.ЗначениеПоказателяМаксимум.Видимость = Истина;
	КонецЕсли;
	Попытка
		Объект.ПредставлениеПериодаПланирования = ПредставлениеПериода(Объект.НачалоПериодаПланирования,
			 КонецДня(Объект.КонецПериодаПланирования));
	Исключение
		Объект.ПредставлениеПериодаПланирования = "";	 
	КонецПопытки;
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Элементы.ДатаНазад.Доступность = Ложь;
	Элементы.ДатаВперед.Доступность = Ложь;
	Элементы.ВыборПериода.Доступность = Ложь;
	
	ПодразделениеПроверки	= Объект.Исполнитель.Подразделение;
	Если ТипЗнч(ПодразделениеПроверки.ТекущийРуководитель) = Тип("СправочникСсылка.Пользователи") Тогда
		ЯвляетсяРуководителем	= 
			(ПодразделениеПроверки.ТекущийРуководитель = CRM_ОбщегоНазначенияСервер.ТекущийПользователь());
	Иначе
		ЯвляетсяРуководителем	= 
			(ПодразделениеПроверки.ТекущийРуководитель = CRM_ОбщегоНазначенияСервер.ТекущийПользователь().ФизическоеЛицо);
	КонецЕсли;
	ЕстьПраваАдминистратора	= (РольДоступна("ПолныеПрава") Или РольДоступна("Администрирование"));
	ЕстьПравоРедактирования	= (ЯвляетсяРуководителем Или ЕстьПраваАдминистратора);
	
	Если Не ЕстьПравоРедактирования Тогда
		Элементы.ДатаНазад.Доступность = Ложь;
		Элементы.ДатаВперед.Доступность = Ложь;
		Элементы.ВыборПериода.Доступность = Ложь;
		Элементы.ЗначениеПоказателя.Доступность = Ложь;
		Элементы.Дата.Доступность = Ложь;
		Элементы.ФормаОтменаПроведения.Видимость = Ложь;
		Элементы.ФормаПровестиИЗакрыть.Видимость = Ложь;
		Элементы.ФормаЗакрыть.Видимость = Истина;
	КонецЕсли;
	
	CRM_ОбщегоНазначенияСервер.ЗакончитьЗамерВремениСозданияФормы(ЭтотОбъект, ВремяНачалаЗамера);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		// СтандартныеПодсистемы.УправлениеДоступом
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
			МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
			МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
		КонецЕсли;
		// Конец СтандартныеПодсистемы.УправлениеДоступом
	КонецЕсли;
	
	CRM_СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	CRM_ОбщегоНазначенияКлиент.НачатьЗамерВремениОткрытияФормы(ЭтотОбъект);
	УстановитьЗаголовокФормы();
	ДоступностьПериодаДляУстановкиПоказателя();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	CRM_СобытияФорм.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	CRM_ОбщегоНазначенияКлиент.НачатьЗамерВремениЗаписиВФорме(ЭтотОбъект, ПараметрыЗаписи);
	Предупреждение = "";
	Если НЕ ДоступностьПериодадляУстановкиПоказателя(Предупреждение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Предупреждение, ,
			 "ПредставлениеПериодаПланирования",
			 "ПредставлениеПериодаПланирования");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	CRM_СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		// СтандартныеПодсистемы.УправлениеДоступом
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
			МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
			МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
		КонецЕсли;
		// Конец СтандартныеПодсистемы.УправлениеДоступом
	КонецЕсли;
	
	CRM_СобытияФорм.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ЗаписьВыполнена =
			CRM_НачалоРаботыСПрограммойВызовСервера.ЗаписатьНастроенныйРазделРешения(ПредопределенноеЗначение("Перечисление.CRM_РазделыНастройкиРешения.Показатели"));
		Если ЗаписьВыполнена Тогда
			Оповестить("ОбновитьНастроенныеРазделы");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	УстановитьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	УстановитьЗаголовокФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДатаВперед(Команда)
	
	Если Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Месяцев = 12;
	ИначеЕсли Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Месяцев = 3;
	Иначе
		Месяцев = 1;
	КонецЕсли;
	Объект.НачалоПериодаПланирования = ДобавитьМесяц(Объект.НачалоПериодаПланирования, Месяцев);
	Объект.КонецПериодаПланирования = КонецМесяца(ДобавитьМесяц(Объект.КонецПериодаПланирования, Месяцев));
	Объект.ПредставлениеПериодаПланирования = ПредставлениеПериода(Объект.НачалоПериодаПланирования,
		 КонецДня(Объект.КонецПериодаПланирования));
	ДоступностьПериодадляУстановкиПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНазад(Команда)
	
	Если Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Год") Тогда
		Месяцев = 12;
	ИначеЕсли Объект.ВидПериода = ПредопределенноеЗначение("Перечисление.Периодичность.Квартал") Тогда
		Месяцев = 3;
	Иначе
		Месяцев = 1;
	КонецЕсли;
	Объект.НачалоПериодаПланирования = ДобавитьМесяц(Объект.НачалоПериодаПланирования, -Месяцев);
	Объект.КонецПериодаПланирования = КонецМесяца(ДобавитьМесяц(Объект.КонецПериодаПланирования, -Месяцев));
	Объект.ПредставлениеПериодаПланирования = ПредставлениеПериода(Объект.НачалоПериодаПланирования,
		 КонецДня(Объект.КонецПериодаПланирования));
	ДоступностьПериодадляУстановкиПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	ПараметрВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериодаПланирования,
		 Объект.КонецПериодаПланирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CRM_ВыборСтандартногоПериода", ПараметрВыбора, Элементы.ВыборПериода, , , ,
		 ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоПериодаПланирования = РезультатВыбора.НачалоПериода;
	Объект.КонецПериодаПланирования  = РезультатВыбора.КонецПериода;
	Объект.ВидПериода = РезультатВыбора.ПериодичностьКонтроля;
	Объект.ПредставлениеПериодаПланирования = РезультатВыбора.ПредставлениеПериода;
	ДоступностьПериодадляУстановкиПоказателя();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	CRM_СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтотОбъект, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = НСтр("ru='Установка показателя';en='Set indicator'") + ": " + Объект.Показатель + "/" + Объект.Исполнитель;
	
	Если CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЦелевойТренд") = "Интервал" Тогда
		Элементы.ЗначениеПоказателяМаксимум.Видимость = Истина;
		Элементы.ЗначениеПоказателя.Заголовок = Элементы.ЗначениеПоказателя.Заголовок + НСтр("ru=' от';en=' from'");
		Элементы.ТрендПоказателя.Видимость = Ложь;
	КонецЕсли;
	Если CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "КратностьЗначений") = "НеИзменять" Тогда
		ЕдиницаИзмерения = CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЕдиницаИзмерения");
	ИначеЕсли CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "КратностьЗначений") = "Тысячи" Тогда
		ЕдиницаИзмерения = НСтр("ru='тыс. ';en='ths. '") 
			+ CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЕдиницаИзмерения");
	ИначеЕсли CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель,
		 "КратностьЗначений") = "Миллионы" Тогда
		ЕдиницаИзмерения = НСтр("ru='млн. ';en='mln. '") 
			+ CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Показатель, "ЕдиницаИзмерения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДоступностьПериодаДляУстановкиПоказателя(Предупреждение = Неопределено)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_ИспользуемыеКлючевыеПоказатели.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрСведений.CRM_ИспользуемыеКлючевыеПоказатели КАК CRM_ИспользуемыеКлючевыеПоказатели
	                      |ГДЕ
	                      |	CRM_ИспользуемыеКлючевыеПоказатели.Показатель = &Показатель
	                      |	И CRM_ИспользуемыеКлючевыеПоказатели.Менеджер = &Менеджер
	                      |	И CRM_ИспользуемыеКлючевыеПоказатели.Регистратор <> &Регистратор
	                      |	И CRM_ИспользуемыеКлючевыеПоказатели.Период >= &НачалоПериода И CRM_ИспользуемыеКлючевыеПоказатели.Период <= &КонецПериода");
						  
	Запрос.УстановитьПараметр("Менеджер", Объект.Исполнитель);
	Запрос.УстановитьПараметр("Показатель", Объект.Показатель);
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериодаПланирования);
	Запрос.УстановитьПараметр("КонецПериода", Объект.КонецПериодаПланирования);
	
	Если Запрос.Выполнить().Пустой() Тогда
		Элементы.ДекорацияНадписьДоступностьПоказателя.ЦветТекста = WebЦвета.ЦветМорскойВолны;
		Элементы.ДекорацияНадписьДоступностьПоказателя.Заголовок = "";
		Элементы.ДекорацияНадписьДоступностьПоказателя.Видимость = Ложь;
		Возврат Истина;
	Иначе
		Элементы.ДекорацияНадписьДоступностьПоказателя.ЦветТекста = WebЦвета.Кирпичный;
		Предупреждение = НСтр("ru='В выбранном периоде показатель уже назначен!';
			|en='The indicator has already been assigned in the selected period!'");
		Элементы.ДекорацияНадписьДоступностьПоказателя.Заголовок = Предупреждение;
		Элементы.ДекорацияНадписьДоступностьПоказателя.Видимость = Истина;
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
